Tekla.Structures.Drawing.EmbeddedObjectAttributes
The EmbeddedObjectAttributes class contains attributes for embedded objects.
Tekla.Structures.Drawing.EmbeddedObjectBase

Tekla.Structures.Drawing.EmbeddedObjectAttributes.xScale
The xScale

Tekla.Structures.Drawing.EmbeddedObjectAttributes.yScale
The yScale

Tekla.Structures.Drawing.EmbeddedObjectAttributes.scaling
The scaling

Tekla.Structures.Drawing.EmbeddedObjectAttributes.frame
The frame

Tekla.Structures.Drawing.EmbeddedObjectAttributes.XScale
Gets or sets the X scaling value. Changing this property
will set the scaling type to ScaleXY.

Tekla.Structures.Drawing.EmbeddedObjectAttributes.YScale
Gets or sets the Y scaling value. Changing this property
will set the scaling type to ScaleXY.

Tekla.Structures.Drawing.EmbeddedObjectAttributes.Scaling
Gets or sets the scaling type.

Tekla.Structures.Drawing.EmbeddedObjectAttributes.Frame
Gets or sets the frame.

Tekla.Structures.Drawing.EmbeddedObjectAttributes.#ctor(System.Boolean)
Initializes a new instance of the Tekla.Structures.Drawing.EmbeddedObjectAttributes class that loads standard attributes.

Tekla.Structures.Drawing.EmbeddedObjectAttributes.#ctor
Initializes a new instance of the Tekla.Structures.Drawing.EmbeddedObjectAttributes class that loads standard attributes.

Tekla.Structures.Drawing.EmbeddedObjectAttributes.#ctor(System.String)
Initializes a new instance of the Tekla.Structures.Drawing.EmbeddedObjectAttributes class that loads given attributes.
AttributeFile: The name of the attribute file

Tekla.Structures.Drawing.EmbeddedObjectAttributes.LoadAttributes(System.String)
Loads the specified attribute file.
AttributeFile: The name of the attribute file.
Returns: True if succeeded.

Tekla.Structures.Drawing.EmbeddedObjectAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.